tests/TestData/StripeWebhook/ApiResponse/bt_list_only_retried_payout.json

{
  "object": "list",
  "data": [
    {
      "id": "txn_1OXXXX",
      "object": "balance_transaction",
      "amount": -200,
      "available_on": 1705276800,
      "created": 1704850096,
      "currency": "gbp",
      "description": "STRIPE PAYOUT",
      "exchange_rate": null,
      "fee": 0,
      "fee_details": [],
      "net": -200,
      "reporting_category": "payout",
      "source": "po_retrySuccess_234",
      "status": "available",
      "type": "payout"
    },
    {
      "id": "txn_20XXXX",
      "object": "balance_transaction",
      "amount": 200,
      "available_on": 1703748850,
      "created": 1703748850,
      "currency": "gbp",
      "description": "REFUND FOR PAYOUT (STRIPE PAYOUT)",
      "exchange_rate": null,
      "fee": 0,
      "fee_details": [],
      "net": 200,
      "reporting_category": "payout_reversal",
      "source": "po_externalId_123",
      "status": "available",
      "type": "payout_failure"
    }
  ],
  "has_more": false,
  "url": "/v1/balance_transactions"
}
