tests/TestData/StripeWebhook/ApiResponse/po_failed.json

{
    "id": "po_externalId_123",
    "object": "payout",
    "amount": 1100,
    "arrival_date": 1598535656,
    "automatic": true,
    "balance_transaction": "txn_00000000000000",
    "created": 1598535656,
    "currency": "gbp",
    "description": "STRIPE PAYOUT",
    "destination": "ba_1HKlLYKkGuKkxwBN6Ptrj9UT",
    "failure_balance_transaction": null,
    "failure_code": null,
    "failure_message": null,
    "livemode": false,
    "metadata": {
    },
    "method": "standard",
    "source_type": "card",
    "statement_descriptor": null,
    "status": "failed",
    "type": "bank_account"
}
